---
kind: type
id: T:Autodesk.Revit.DB.FamilyHostingBehavior
source: html/978751ef-c881-d15f-405f-9a2e96577daf.htm
---
# Autodesk.Revit.DB.FamilyHostingBehavior

Types of hosts into/onto which a family can be hosted.
 For informative purposes only. Does not affect anything in Revit!

## Syntax (C#)
```csharp
public enum FamilyHostingBehavior
```